# 这里文件里面只记录一些最基本的可变参数
# 比如不同指标的权重，不同间隙大小应该扣除的分数，等等



class Parameter:

    # def __init__(self, avgSpeed, avgSpeedKM):
    #     self.avgSpeed = avgSpeed
    #     self.avgSpeedKM = avgSpeedKM

    # 任务名称
    taskName = "0"
    taskID = 0
    avName = "onsite1"
    sceneName = "onsiteScene"
    defaultAimType = 'onsite'
    sceneType = None
    online = None

    # 场景中地图目录
    scn_folder_name = None

    # 初始地图位置
    map_file = None
    # 目标结束位置信息
    aim_place_xosc_file_path = None
    # 交叉口停车线信息
    cross_line_json_file_path = None
    # 处理后的地图位置
    all_road_info_file = None
    # 轨迹信息
    csv_file_path = None
    # 计算好的指标数据
    score_data = None

    # 目标路径信息
    aim_path_json_file_path = None


    # 车辆长度
    length = 4.49
    width = 1.95

    # 计算精度
    simuAccuracy = 0.03
    # 设置时间差（秒级，0.2表示200毫秒）
    threshold_minutes = 0.5
    # 设置图表的粒度
    granularity = 0.1

    # 设置期望速度
    maxSpeedKM = 30
    avgSpeedKM = 30
    avgSpeed = 30/3.6
    avgSpeedKMDict = {
        "1": 25,
        "2": 25,
        "3": 25,
        "4": 15,
        "5": 25,
        "6": 15,
        "7": 25,
        "8": 25,
        "9": 15,
        "10": 15,
    }

    # wth: 设置AV车影响范围
    affected_metre = 50
    # wth:当前场景是否结束
    done = False

    # 判断碰撞的仿真时间开始阈值
    crashSimuTimeThreshold = 1

    # 设置未被主车影响的从车通过场景的时间
    svSimuTimeWithoutDisturbance = 30
    svSimuTimeDisturbanceMax = 70
    # 定义跟随的判断距离，两个车前后距离差是多少米算是跟随，这里是用的两个车的中心点的距离，所以要加上车的4米的距离
    svDisturbanceDistance = 10
    svSimuTimeWithoutDisturbanceDict = {
        "1": 20,
        "2": 45,
        "3": 30,
        "4": 30,
        "5": 30,
        "6": 30,
        "7": 30,
        "8": 30,
        "9": 30,
        "10": 30,
    }

    # 场景开始标志
    # keyPoints = [{'x': -1226.6639510511568, 'y': -395.0813736883616, 'z': 0}]
    keyPoints = []
    # 大范围
    keyPointsRangeMax = 10
    # 小范围
    keyPointsRangeMin = 1.7

    # 停车标志的经纬度位置，和感知到停止标志应该停止的距离
    stopSignalPositionList = [[-1226.6639510511568, -395.0813736883616]]
    stopSignalRange = 10
    # 判断停车的距离阈值（两帧之间行驶多少米以内算停车），和时间阈值，需要停车多久（在距离阈值以内的停车时间）
    stopCarThresholdDistance = 0.5
    stopCarThresholdTime = 0.1

    # 矩形施工区的四个角点坐标，依次是左前、左后、右后、右前（车辆行进方向）
    # ConstructionPosition = [[(-817.0452075803479, -310.70250173406356), (-816.562552204979, -310.6478808632149), (-816.7009216054258, -310.73925961292065), (-816.906838178244, -310.61112298931454)],
    #                         [(-1171.129344093267, -311.3605077743416), (-1171.6309756613834, -311.4008005974161), (-1171.4561659999456, -311.3140667891039), (-1171.3041537525348, -311.4472415883187)],
    #                         [(-1144.5284410438019, -439.3650431936049), (-1143.7201370107748, -439.3387519317604), (-1143.958596095477, -439.3841021430321), (-1144.289981956812, -439.3196929986198)]]
    ConstructionPosition = []

    # 按次扣分
    miniScore = {'横向加速度': 5,
                 '横向加加速度': 5,
                 '纵向加速度': 5,
                 '纵向加加速度': 5,
                 '未按规定路线行驶': 1,  # 碰撞和未按规定路线行驶比较特殊，不用来计算分数，只用来计算次数，如果碰撞次数有1次就直接安全分为0
                 "碰撞": 100,
                 "安全员介入": 100,
                 "TTC": 1, # 这里是因为后面还要乘权重，权重里有这个数据了
                 "闯红灯": 1,  # 这里是因为后面还要乘权重，权重里有这个数据了
                 "未遵守停车标志": 1}  # 这里是因为后面还要乘权重
    # 按次扣分的无敌时间
    invincibleTime = 60

    # 扣分的上限
    miniScoreMaxLimit = {
        '倒车': 10,
    }

    # onsite权重配置文件
    weightData = {
        "sceneWeightDict": {
            "free": 0.2,
            "byCrossing": 1.5,
            "sideOn": 1.2,
            "huandao": 1.5,
            "onsite": 1,
        },
        "fullScoreDict": {
            "1": 10,  # 安全满分
            "2": 10,  # 舒适满分
            "3": 100,  # 效率满分
            "4": 10,  # 协作满分
            "5": 10,  # 交规符合满分
        },
        "indexWeightDict": {
            "10000": 0.5,  # 安全
            "20000": 0.3,  # 舒适
            "30000": 0.5,  # 效率 ,需要保证安全效率舒适加起来是1
            "40000": 0.1,  # 协作
            "50000": 0.1,  # 交规符合
            # "10001": 100,  # 碰撞，下面的这些不是权重，现在改成了*的分数
            # "10002": 10,  # ttc
            # "10003": 2.5,  # 对向车道
            # "10004": 0,  # 压实线
            # "10005": 2.5,  # 超速
            # "10006": 100,  # 超出车道线驶出车道
            # "10007": 0,  # 横向间距
            # "10008": 0,  # 在禁行区行驶
            # "10009": 0,  # 闯红灯
            # "10010": 0,  # 未按规定车道行驶
            # "10011": 0,  # 停车压停止线
            # "10012": 100,  # 安全员介入
            # "10013": 0,  # 压虚线
            # "10014": 2.5,  # 停车标志前停车
            "10001": 100,  # 碰撞，下面的这些不是权重，现在改成了*的分数
            "10002": 10,  # ttc
            "10003": 0,  # 对向车道
            "10004": 0,  # 压实线
            "10005": 0,  # 超速
            "10006": 10,  # 超出车道线驶出车道
            "10007": 0,  # 横向间距
            "10008": 0,  # 在禁行区行驶
            "10009": 5,  # 闯红灯
            "10010": 0,  # 未按规定车道行驶
            "10011": 0,  # 停车压停止线
            "10012": 0,  # 安全员介入
            "10013": 0,  # 压虚线
            "10014": 0,  # 停车标志前停车
            # "20001": 5,  # 横向加速度
            # "20002": 5,  # 横向加加速度
            # "20003": 5,  # 纵向加速度
            # "20004": 5,  # 纵向加加速度
            # "20005": 5,  # 猛打转向盘
            "20001": 2,  # 横向加速度
            "20002": 2,  # 横向加加速度
            "20003": 2,  # 纵向加速度
            "20004": 2,  # 纵向加加速度
            "20005": 2,  # 猛打转向盘
            # "30001": 0,  # 时间
            # "30002": 10,  # 速度
            # "30003": 0,
            # "30004": 10,  # 任务是否完成
            # "30005": 5,  # 倒车扣分
            # "40001": 2,  # 交通协调性干扰背景车辆
            "30001": 50,  # 时间
            "30002": 0,  # 速度
            "30003": 0,
            "30004": 50,  # 任务是否完成
            "30005": 0,  # 倒车扣分
            "30006": 0,
            "40001": 2,  # 交通协调性干扰背景车辆
        },
        "sceneNameDict": {
            "free": ["自由通过", "随便跑"],
            "byCrossing": ["交叉口", "通过交叉口"],
            "sideOn": ['其他车辆侧向汇入汇出', "侧向汇入"],
            "huandao": ["通过环岛"],
            "onsite": ["onsiteScene"]
        }
    }

    # onsite期望时间配置文件
    missonExpectTime = {
        "0_17_straight_straight_21": 12,
    }

    timeIndexDict = [
        '碰撞',
        '安全员介入',
        '驶出行车道',
        'TTC',
        'PET',
        '驶入对向车道',
        '压实线',
        '压虚线',
        '未遵守停车标志',
        '超速',
        '闯红灯',
        '横向间距',
        '禁行区行驶',
        "未按规定车道行驶",
        "停车压停止线",
        "未按规定路线行驶",
        "是否完成任务",
        '横向加速度',
        '横向加加速度',
        '纵向加速度',
        '纵向加加速度',
        '转向角变化',
        '倒车'
    ]

    numIndexDict = [
        '横向加速度',
        '横向加加速度',
        '纵向加速度',
        '纵向加加速度',
        "未按规定路线行驶",
        "闯红灯",
        "碰撞",
        "安全员介入",
        "TTC",
        "驶入对向车道",
        "驶出行车道",
        "未遵守停车标志",
        "倒车",
        "超速",
    ]







